app/controllers/api_controller.rb

	def add_subscription
		new_subscription = Subscription.new(subscription_params)
		previous_subscription = Subscription.find_by(user_id:new_subscription.user_id,subscription_type_id:new_subscription.subscription_type_id)

		if previous_subscription
			new_subscription = previous_subscription
		else
			new_subscription.start_date = Time.now
			new_subscription.end_date = Time.now
		end

		new_subscription.end_date = new_subscription.end_date + 1.year
		new_subscription.save
---
SELECT `subscriptions`.* FROM `subscriptions` WHERE `subscriptions`.`user_id` IS NULL AND `subscriptions`.`subscription_type_id` IS NULL LIMIT 1
INSERT INTO `subscriptions` (`created_at`, `end_date`, `start_date`, `updated_at`) VALUES ('2013-12-17 23:05:59', '2014-12-17 23:05:59', '2013-12-17 23:05:59', '2013-12-17 23:05:59')
UPDATE `subscriptions` SET `end_date` = '2015-12-17 23:15:06', `updated_at` = '2013-12-17 23:15:06' WHERE `subscriptions`.`id` = 980190963

	def all_subscriptions
		subscriptions = Subscription.where(user_id:params[:user_id])
		render :json => {subscriptions:subscriptions,count:subscriptions.count}
---
SELECT `subscriptions`.* FROM `subscriptions` WHERE `subscriptions`.`user_id` = 980190964
SELECT COUNT(*) FROM `subscriptions` WHERE `subscriptions`.`user_id` = 980190964

	def get_subscription
		subscriptions = Subscription.where(user_id:params[:user_id],subscription_type_id:params[:subscription_type_id])
		render :json => {subscriptions:subscriptions , count:subscriptions.count}
---
SELECT `subscriptions`.* FROM `subscriptions` WHERE `subscriptions`.`user_id` = 980190964 AND `subscriptions`.`subscription_type_id` = 1
SELECT COUNT(*) FROM `subscriptions` WHERE `subscriptions`.`user_id` = 980190964 AND `subscriptions`.`subscription_type_id` = 1

	def register_user
		user = User.new(user_params)

		user_db = User.find_by(email:user.email)

		if user_db
			render :json => {status:"error", error_code:101, message:"user_registered_previously"},:status=> 500 and return
		end


		user.save
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'tst@tst' LIMIT 1
INSERT INTO `users` (`app_id`, `created_at`, `email`, `last_login`, `password_hash`, `password_salt`, `updated_at`) VALUES (1, '2013-12-17 22:32:34', 'tst@tst', '2013-12-17 22:32:33', '$2a$10$mrzbLiYzAyJX88WINsI.je5bpIgfZxIo7rRDC6ZTL5SDcuR4Q4hD6', '$2a$10$mrzbLiYzAyJX88WINsI.je', '2013-12-17 22:32:34')

	def password_reset
		user = User.find_by(email:params[:email],app_id:params[:app_id])
		user.confirmation_hash = SecureRandom.uuid.to_s
		user.save
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'tst@tst.com' AND `users`.`app_id` = 980190964 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `confirmation_hash` = '7fb58dce-0f60-4027-b117-2c958a69f612', `updated_at` = '2013-12-17 19:07:18' WHERE `users`.`id` = 980190964