app/controllers/api_controller.rb

	def register_user
		user = User.new(user_params)

		user_db = User.find_by(email:user.email)

		if user_db
			render :json => {status:"error", error_code:101, message:"user_registered_previously"},:status=> 500 and return
		end


		user.save
---
INSERT INTO `users` (`created_at`, `email`, `updated_at`) VALUES ('2013-12-17 17:31:16', 'm@m.com', '2013-12-17 17:31:16')